import { Box, Container, Flex, Text, Title } from "@mantine/core";
import Image from "next/image";
import styles from "./style.module.css";
import HeroImage13 from "@/public/Image 13@2x.png";
import DrImage from "@/public/Mask Group 5@2x.png";

export default function Hero11() {
  return (
    <div>
      <Box style={{ position: "absolute", zIndex: "1" }}>
        <Image
          src={HeroImage13}
          alt="Home Page Image For Third Hero Page"
          className={styles.img}
        />
      </Box>

      <Title
        className={styles.titleRes}
        style={{
          zIndex: "2",
          position: "relative",
          top: "150px",
          left: "150px",
          width: "fit-content",
        }}
        ta="left"
        c="#fff"
        fz="60px"
      >
        الطب التجميلي
      </Title>

      <Text
        className={styles.desText}
        style={{
          zIndex: "2",
          position: "relative",
          top: "600px",
          width: "fit-content",
          background: "linear-gradient(#12D0E700, #B6E8EE)",
        }}
        fz="25px"
        c="#0C205D"
        pr="24px"
        pl="24px"
        pb="32px"
        lh="2"
        ta="right"
      >
        قسم الطب التجميلي المتكامل غير الجراحي يعرف الطب التجميلي بانه مجموعة
        الاجراءات الطبية التي تهدف الى تحسين المظهر الخارجي للمريض، ويمكن ان
        تجرى لاغراض وظيفية او جمالية، ولقد زاد اهمية تخصص الطب التجميلي لاهميته
        في العامل النفسي للمريض وتحسن حالته النفسية بعد اجراء تجميل على مظهره
        <br /> <br /> <br /> سواء كان لمعالجة تشوه او تحسين في المظهر اقسام.
        الطب. التجميلي Botox ❇ <br />
        تشريح عضلات الوجه والتعرف على العضلات المسببة للتجاعيد الحركية ❇معالجة
        تجاعيد الثلث العلوي من الوجه بالبوتوكس ❇معالجة تجاعيد ما يسمى بتجاعيد
        الأرنب ❇معالجة تجاعيد الرقبة ❇معالجة الابتسامة اللثوية ❇معالجة فرط
        التعرق ❇معالجة داء الوردية في الوجنتين ❇معالجة الساد فيس. ❇النيفرتيتي
        نيك ليف ❇معالجة تجاعيد العنق ❇الميزو بوتكس. ❇معالجة العضلات الماضغة
        ❇تنحيف الوجه بالبوتكس. ❇معالجة تجاعيد الجفن السفلي. ❇معالجة الsmoker
        lines ❇انواع البوتكس المختلفة والفروقات بينها. ❇اختلاطات البوتكس
        وتدبيرها. ‏‎الفيلر Filler ♦ التعرف على الطرق المتعددة لحقن الفيلر ♦ فيلر
        الشفاه ♦ فيلر أسفل العين ♦ فيلر الخدود ♦ حقن الفيلر بتقنية تكساس ♦ حقن
        الفيلر لتعديل شكل الأنف ♦ حقن فيلر الخطوط الضاحكة ♦حقن الفيلر لمنطقة
        الصدغ. ♦حقن الفيلر لرفع الحاجب. ♦حقن الفيلر لليدين. ♦حقن الفيلر بالذقن.
        ♦حقن الفيلر لمنطقة المقطب. ♦حقن الفيلر بالكانيولا. ♦تكنيك معالجة اكثر من
        منطقة بالوجه بنفس الوقت. ♦اعادة التناسب للوجه بحقن الفيلر. ♦ الحالات
        التي يجب بها تجنب حقن الفيلر ♦اختلاطات حقن الفيلر وطريقة تدبيرها.
        ‏‎الميزوثيرابي ‏‎(تعريفه، مكوناته ،خصائص المواد الكيميائية المكونة
        للميزوثيرابي،انواعه حسب مواضع حقنه في مناطق الجسم) 🔶 التعرف على مادة
        الميزو ومكوناتها وأنواعها 🔶 التعرف على طريقة الحقن وعمق الحقن المناسب
        لكل منطقة وكل حالة 🔶 استخدام الميزوثيرابي لمعالجة تساقط الشعر 🔶
        استخدام الميزو لنضارة البشرة 🔶 استخدام الميزو لتذويب الدهون 🔶 استخدام
        جهاز الديرمابن مع الميزو (اهميته وكيفية الاستخدام لكل منطقة في الوجه)
        🔶مشاركة الميزوثيربي مع الفيلر والبوتكس. 🔶الاستخدام الامثل للميزوثيربي.
        🔶موانع الاستخدام. 🔶الاختلاطات وطريقة تدبيرها. ‏‎البلازما الغنية PRP ✅
        الطريقة الأمثل لسحب الدم مع الحفاظ على الصفيحات ✅ استخدام المثفلة لفصل
        الصفيحات عن الدم ✅ طرق حقن البلازما بحسب المنطقة ✅ حقن البلازما في
        الوجه ✅ حقن البلازما في فروة الرأس ✅الفرق بين تحضير انواع البلازما
        المختلفة. ‏✅PRPماتركس. ✅موانع تطبيق البلازما. ✅الاختلاطات وطريقة
        تدبيرها. ✅معالجة الهالات السوداء. ✅المشاركة مع الميزوثيربي بمختلف
        التطبيقات. خيوط الشد threads 🌀 حالات استخدام خيوط الشد 🌀 الحالات التي
        يجب تجنب خيوط الشد فيها 🌀 كيفية استخدام خيوط الشد 🌀انواع الخيوط
        المختلفة. 🌀تكنيكات شد الوجه. 🌀تكنيكات رفع الحاجب. 🌀تكنيكات شد الرقبة.
        🌀الاختلاطات الممكنة والية تدبيرها. 🌀مضادات الاستطباب. 🌀الحالات
        المثالية لتطبيق الخيوط. 🌀تعليمات الواجب الالتزام بها بعد تطبيق الخيوط.
      </Text>

      <Container>
        <Flex
          justify="center"
          align="flex-start"
          className={styles.flexResponsive}
        >
          <Image src={DrImage} alt="Mis.Word" className={styles.img2} />

          <Box
            className={styles.boxRes2}
            style={{
              background: "linear-gradient(#CBCBCB, #FFFFFF00)",
              padding: "32px",
              width: "70%",
              zIndex: "1",
              borderRadius: "277px",
              position: "relative",
            }}
          >
            <>
              <Title ta="right" fz="45px" mt="xl" c="#0064AD">
                د. أحمد سمير الدليمي
              </Title>

              <Text mt="md" c="#10224B" ta="right" fz="xl">
                ماجستير أختصاص. أحياء مجهرية طبيه والفحص الجزيئي . طب تجميل
                الجراحي والغير جراحي
              </Text>
            </>
          </Box>
        </Flex>
      </Container>
    </div>
  );
}
