import { Box, Container, Flex, Text, Title } from "@mantine/core";
import Image from "next/image";
import styles from "./style.module.css";
import HeroImage10 from "@/public/Image 10@2x.png";
import DrImage from "@/public/Mask Group 5@2x.png";

export default function Hero9() {
  return (
    <div>
      <Box style={{ position: "absolute", zIndex: "1" }}>
        <Image
          src={HeroImage10}
          alt="Home Page Image For Third Hero Page"
          className={styles.img}
        />
      </Box>

      <Title
        className={styles.titleRes}
        style={{
          zIndex: "2",
          position: "relative",
          top: "150px",
          left: "150px",
          width: "fit-content",
        }}
        ta="left"
        c="#fff"
        fz="60px"
      >
        قسم الليزر والاشعة
      </Title>

      <Text
        className={styles.desText}
        style={{
          zIndex: "2",
          position: "relative",
          top: "600px",
          width: "fit-content",
          background: "linear-gradient(#12D0E700, #B6E8EE)",
        }}
        fz="25px"
        c="#0C205D"
        pr="24px"
        pl="24px"
        pb="32px"
        lh="2"
        ta="right"
      >
        يستخدم الليزر في العديد من عمليات التجميل بما في ذلك إزالة العلامات
        الجلدية التي تظهر منذ الولادة (الوحمة)‍ • يتم توجيه أشعة ليزر منخفضة
        الطاقة ذات لون أخضر على منطقة الجلد المصابة‍ • تقوم الأوعية الدموية
        الموجودة فيها بامتصاص الطاقة وتصبح ساخنة جدا لدرجة أنها تنحرق‍ • بينما
        لا يتأثر الجلد المحيط حيث أن امتصاصه لأشعة الليزر تكون أقل بكثير من هذه
        التصبغات‍ • يستخدم الليزر أيضا لإزالة الوشم بطريقة مشابهة‍ الليزر لإنبات
        الشعر‍ يستخدم الليزر أيضا للمساعدة على إنبات الشعر في حالات الصلع، بما
        يعرف بالعلاج بالضوء أو الأحمر (red light therapy)، أو علاج الليزر البارد
        (cold laser therapy)، الذي يقوم بإصدار فوتونات يتم امتصاصها بواسطة
        الخلايا الضعيفة حيث تحفزها على النمو.‍ لكن لا تزال هذه الطريقة تعطي
        نتائج غير ثابتة حيث يستفيد منها بعض المرضى بينما لا يستفيد آخرون، لذلك
        هي بحاجة للمزيد من الدراسات.‍ ازالة الشعر بالليزر (ليزر الشعر)‍ يعتبر
        استخدام الليزر لإزالة الشعر من أكثر التطبيقات انتشارا، حيث يتم إصدار
        شعاع خفيف من الليزر يتم امتصاصه فقط من قبل بصيلات الشعر، من غير أن يؤذي
        الجلد، حيث تتحول الطاقة الممتصة في البصيلات إلى حرارة وتدمرها خلال أجزاء
        من الثانية.‍ استخدامات تجميلية أخرى‍ • الليزر لعلاج الأمراض الجلدية‍ •
        علاج البهاق بالليزر‍ • علاج حب الشباب بالليزر‍ • توريد الشفايف بالليزر‍
        الليزر في طب الأسنان‍ يستخدم الليزر في طب الأسنان بدل من المحفار (drill)
        التقليدي لحفر الأسنان المتسوسة، حيث تكون أنسجة السن المتسوسة أضعف من
        الأنسجة السليمة، فيتم استخدام الليزر بطاقة كافية للتخلص من التسوس وعدم
        إيذاء الأنسجة السليمة. أيضا يستخدم الليزر عند حدوث نزيف في تجاويف
        الأسنان العميقة أثناء عمل الجراحة لوقف النزيف عن طريق "ختم" (seal)
        الأوعية الدموية. لا يسبب استخدام الليزر الألم حيث أنه يستخدم بسرعة أكبر
        بكثير من الوقت اللازم للأعصاب لتحفيز الشعور بالألم، وبالتالي لا يحتاج
        المريض للتخدير.‍ من الاستخدامات الشائعة لليزر أيضا في طب الأسنان
        التبييض، حيث يتم استخدام الليزر مع جل التبييض، الذي يقوم بإزالة البقع عن
        الأسنان، لتسريع عملية التبييض.‍ علاج البواسير بالليزر‍ يتم تحديد
        الشرايين المرتبطة بالبواسير باستخدام جهاز الدوبلر (Doppler)، ثم يتم
        ادخال ألياف بصرية إلى مكان هذه الشرايين، وإصدار أشعة من الليزر من خلالها
        بطاقة كافية لقطع الدورة الدموية عن الشرايين.‍ بالإضافة لهذه الاستخدامات،
        هنالك العديد من الاستخدامات الطبية الأخرى للليزر والتي تشمل:‍ • علاج
        الألم، وبالأخص الآلام عصبية المنشأ.‍ • كي أو ختم نهايات الأعصاب للتخفيف
        من الآلام بعد العمليات الجراحية، والأوعية الدموية للمساعدة في منع حدوث
        نزيف وفقدان الدم، والأوعية اللمفاوية للتقليل من التورم والحد من انتشار
        الأورام.‍ • التخلص من الثآليل والشامات وعلامات الولادة وحروق الشمس.‍ •
        التقليل من مظهر التجاعيد والندب وعيوب الجلد. • علاج الناسور (Fistula) في
        أماكن مختلفة من الجسم
      </Text>

      <Container>
        <Flex
          justify="center"
          align="flex-start"
          className={styles.flexResponsive}
        >
          <Image src={DrImage} alt="Mis.Word" className={styles.img2} />

          <Box
            className={styles.boxRes2}
            style={{
              background: "linear-gradient(#CBCBCB, #FFFFFF00)",
              padding: "32px",
              width: "70%",
              zIndex: "1",
              borderRadius: "277px",
              position: "relative",
            }}
          >
            <>
              <Title ta="right" fz="45px" mt="xl" c="#0064AD">
                د. أحمد سمير الدليمي
              </Title>

              <Text mt="md" c="#10224B" ta="right" fz="xl">
                ماجستير أختصاص. أحياء مجهرية طبيه والفحص الجزيئي . طب تجميل
                الجراحي والغير جراحي
              </Text>
            </>
          </Box>
        </Flex>
      </Container>
    </div>
  );
}
