import { Box, Container, Flex, Text, Title } from "@mantine/core";
import Image from "next/image";
import styles from "./style.module.css";
import HeroImage3 from "@/public/Image 4@2x.png";
import DrImage from "@/public/Mask Group 5@2x.png";

export default function Hero3() {
  return (
    <div>
      <Box style={{ position: "absolute", zIndex: "1", width: "100%" }}>
        <Image
          src={HeroImage3}
          alt="Home Page Image For Third Hero Page"
          className={styles.img}
        />
      </Box>

      <Title
        className={styles.titleRes}
        style={{
          zIndex: "2",
          position: "relative",
          top: "150px",
          left: "150px",
          width: "fit-content",
        }}
        ta="left"
        c="#fff"
        fz="60px"
      >
        التقنيات الصحية والطبية 
      </Title>

      <Text
        className={styles.desText}
        style={{
          zIndex: "2",
          position: "relative",
          top: "900px",
          width: "fit-content",
        }}
        fz="25px"
        c="#0C205D"
        pr="24px"
        pl="24px"
        lh="2"
        ta="right"
      >
        نطلق قسم تقنيات المختبرات الطبية وهو من احد تطبيقات العلوم الطبية
        التطبيقة في كلية التقنيات الصحية و الطبية (بغداد) والذي تم افتتاحه منذ
        1996 – 1997 من رؤية ورسالة الجامعة التقنية الوسطى  الرامية إلى تقديم
        تعليم عالمي متميز في بيئة محلية لإعداد قادة في مجال العلوم الطبية
        التطبيقية لديهم القدرة على تقديم الخدمات الصحية المتنوعة على قدر عال من
        المسئولية والكفاءة مع التزام تام بقيمنا الدينية والثقافية.
        <br /> <br /> برنامج تقنيات المختبرات الطبية هو مزيج من العلوم الأساسية
        والمهارات المخبرية السريرية التي تم تصميمها من قبل خبراء في هذا المجال
        مع مراعاة التطورات الحديثة في هذا المجال لتحقيق المعايير الدولية، كما
        قامت الجامعة باستقطاب أعضاء هيئة تدريس متميزين في البحث والتعليم من جميع
        التخصصات العلمية لتقديم المنهج، ولهم سنوات كثيرة من العمل في التدريس
        العلمي و العملي . وعلاوة على ذلك، يتوفر مختبرات مجهزة تجهيزا جيدا لتعزيز
        المعرفة النظرية التي اكتسبها الطلاب، كما يوجد في الجامعة مكتبة حديثة تصل
        طلابنا مع مئات من الكتب والمجلات والمواقع ذات الصلة وهي في تحديث مستمر.
      </Text>

      <Box
        className={styles.boxRes}
        p="24px"
        style={{
          background: "linear-gradient(#B6E8EE, #12D0E700)",
          zIndex: "2",
          position: "relative",
          top: "1000px",
          width: "fit-content",
        }}
      >
        <Text c="#0C205D" fz="25px" lh="2" ta="right">
          واحدة من الكليات المهمة والاساسية التي شقت طريقها وبكل ثبات نحو التقدم
          والارتقاء بالعلم والمعرفة  كونها تساهم وبشكل فعال في رفد القطاع الصحي
          بالكوادر التقنية المؤهلة وبجميع الاختصاصات لتكون واحدة من الركائز
          الاساسية الداعمة والرافدة للقطاع الصحي في عراقنا الحبيب. حيث تم
          استحداث كلية التقنيات الصحية والطبية في جامعة العين العراقية في العام
          الدراسي 2018-2019 وقد كانت تضم ثلاثة اقسام فقط وهي التخدير وصناعة
          الاسنان والبصريات ثم في السنوات اللاحقة تمت اضافة قسمي المختبرات
          الطبية والاشعة والسونار. وتستقبل الكلية سنويا اعداد من الطلبة في
          اقسامها الاربعة وللدراستين الصباحية والمسائية. وهي مجهزة بقاعات دراسية
          مكيفة مركزيا تحتوي على جميع وسائل التعليم الحديثة من اجهزة العرض
          وانظمة الصوت لضمان توزيع الصوت داخل القاعة الدراسية وكذلك الكلية مجهزة
          بمختبرات دراسية نموذجية مزودة بجميع الاجهزة والمستلزمات المختبرية
          اللازمة والضرورية للعمل المختبري ومن مناشيء عالمية وبما يتطابق مع
          معايير الجودة والسلامة والامان.  من اولويات واهداف الكلية  اعداد طلبة
          متميزين وقادرين على المساهمة الفعالة والاساسية في تقدم عراقنا الحبيب
          علميا وصحيا. حيث يتخرج سنويا عدد من التقنيين المؤهلين علميا وعمليا
          للعمل ضمن المؤسسات الصحية. كما وساهمت الكلية وبشكل واسع في خدمة
          المجتمع عبر اقامة الورش والندوات التوعوية لمعالجة الكثير من المشاكل
          ووضع الاسس العلمية للمعالجة والحلول. والى يومنا هذا لا تزال الكلية
          نبراسا للعلم والمعرفة ولها الدور الفعال الريادي في خدمة المجتمع وبناء
          عراقنا الحبيب.
        </Text>
      </Box>

      <Container>
        <Flex
          justify="center"
          align="flex-start"
          className={styles.flexResponsive}
        >
          <Image src={DrImage} alt="Mis.Word" className={styles.img2} />

          <Box
            className={styles.boxRes2}
            style={{
              background: "linear-gradient(#CBCBCB, #FFFFFF00)",
              padding: "32px",
              width: "70%",
              zIndex: "1",
              borderRadius: "277px",
              position: "relative",
            }}
          >
            <>
              <Title ta="right" fz="45px" mt="xl" c="#0064AD">
                د. أحمد سمير الدليمي
              </Title>

              <Text mt="md" c="#10224B" ta="right" fz="xl">
                ماجستير أختصاص. أحياء مجهرية طبيه والفحص الجزيئي . طب تجميل
                الجراحي والغير جراحي
              </Text>
            </>
          </Box>
        </Flex>
      </Container>
    </div>
  );
}
